//
//  WeeklyTasksConfig.swift
//  Scheduler
//
//  Created by ByteDance on 6/3/25.
//

import Foundation

enum WeeklyTasksConfig {
    // 按星期几定义的任务字典
    static let WanerTask: [Int: [String]] = [
        1: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇范文", "9-10户外", "10-11读书90页", "11-12写一页字", "14-15写一篇作文", "15-16写日记", "16-17练琴", "17-18户外", "21点半抹油上床"], // 周日
        2: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读1篇英语背单词", "9-10户外", "10点半钢琴课", "11点半写一页字", "14-15读书90页", "15-16写日记", "17-18户外", "18点半-19阅读理解", "21点半抹油上床"], // 周一
        3: ["8-9滴眼药水", "8-9练反转拍", "8-9背1篇范文", "9-10户外", "10-11读书90页", "11-12写一页字", "14-15练琴", "15-17奥数", "17-18户外", "18点半-19写日记","21点半抹油上床"],  // 周二
        4: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇范文", "9-10户外", "11-12写一页字", "14-15练琴", "15-16写日记", "16-17数学2页", "17-18户外", "21点半抹油上床"], // 周三
        5: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读1篇英语背单词", "9-10户外", "10-11钢琴课", "11点半-12写一页字", "14-15读书90页", "15-16写日记", "16-17语文基础", "17-18户外", "21点半抹油上床"], // 周四
        6: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇范文", "9-10户外", "10-11读书90页", "11-12写一页字", "14-15练琴", "15-16写日记", "16-17数学2页", "17-18户外", "21点半抹油上床"], // 周五
        7: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇范文", "9-10户外", "10-11读书90页", "11-12写一页字", "14-15练琴", "15-16写日记", "16-17语文基础", "17-18户外", "21点半抹油上床"], // 周六
    ]
    static let JohnTask: [Int: [String]] = [
        1: ["8-9滴眼药水", "8-9练反转拍", "8-9读3本续本", "9-10户外", "10-11读书60页", "11-12数学2页", "14-15写两页字", "15-16写日记","16-17练琴", "17-18户外", "21点半抹油上床"], // 周日
        2: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇日记背1篇", "9-10户外", "10-11读书60页", "11点半钢琴课", "14-15写两页字", "15-17奥数课", "17-18户外", "18半-19写日记", "21点半抹油上床"], // 周一
        3: ["8-9滴眼药水", "8-9练反转拍", "8-9读3本续本", "9-10户外", "10-11读书60页", "11-12练琴", "14-15写两页字", "15-16做奥数题", "17-18户外", "18半-19写日记", "21点半抹油上床"], // 周二
        4: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇日记背1篇", "9-10户外", "10-11读书60页", "11-12练琴", "14-15写两页字", "15-16写日记", "17-18户外", "21点半抹油上床"], // 周三
        5: ["8-9滴眼药水", "8-9练反转拍", "8-9读3本续本", "9-10户外", "10-11读书60页", "11点半钢琴课", "14-15写两页字", "15-16写日记", "16-17做奥数题", "17-18户外", "21点半抹油上床"], // 周四
        6: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇日记背1篇", "9-10户外", "10-11读书60页", "11-12写两页字", "14-15练琴", "15-16写日记", "16-17数学2页", "17-18户外", "21点半抹油上床"], // 周五
        7: ["8-9滴眼药水", "8-9练反转拍", "8-9朗读3篇日记背1篇", "9-10户外", "10-11读书60页", "11-12写一页字", "14-15练琴", "15-16写日记", "16-17数学2页", "17-18户外", "21点半抹油上床"], // 周六
    ]
    
    

    // 获取指定日期的任务列表
    static func tasks(for date: Date, userName name: String? = nil) -> [String] {
        let calendar = Calendar.current
        let weekday = calendar.component(.weekday, from: date) // 1-7
        let task = (name?.contains("莞") ?? true) ? WanerTask : JohnTask
        return task[weekday] ?? []
    }

    // 星期几名称映射
    static func weekdayName(for weekday: Int) -> String {
        let formatter = DateFormatter()
        formatter.locale = Locale(identifier: "zh_CN")
        return formatter.weekdaySymbols[weekday - 1]
    }
}
